Revit 2027 API
BuiltInFailures.GroupFailures.GroupAmongstLoadedRenamed Property
 A group or groups that was loaded was renamed because its name was not unique amongst the groups in the file being loaded. Most likely a model subgroup had the same name as the loaded file.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId GroupAmongstLoadedRenamed { get; }
Public Shared ReadOnly Property GroupAmongstLoadedRenamed As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ GroupAmongstLoadedRenamed {
	FailureDefinitionId^ get ();
}
static member GroupAmongstLoadedRenamed : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.GroupFailures Class
Autodesk.Revit.DB Namespace